<a href="https://colab.research.google.com/github/Ritvik10/Data-Science-Overview-Material-Practice-and-Revision/blob/main/Day_20_Aggregate_functions_%26_Joins.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
"""
CREATE DATABASE University;

USE University;

CREATE TABLE STUDENT(
ADMN_ID int AUTO_INCREMENT,
NAME char(100) NOT NULL,
AGE int,
Email varchar(200) UNIQUE,
PRIMARY KEY(ADMN_ID)
);


CREATE TABLE COURSE_INFO(
COURSE_ID int AUTO_INCREMENT,
COURSE_NAME char(100) NOT NULL,
COURSE_CREDITS int NOT NULL,
ADMN_ID int NOT NULL,
PRIMARY KEY (COURSE_ID),
FOREIGN KEY (ADMN_ID) REFERENCES STUDENT(ADMN_ID)
);

INSERT INTO STUDENT (Name, Age, Email) VALUES ('Steve', 100, 'steve@rogers.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Clint', 56, 'clint@barton.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Bruce', 100, 'bruce@banner.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Tony', 78, 'tony@stark.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Natasha', 98, 'natasha@romaoff.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Peter', 34, 'peter@parker.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Thor', 15, 'thor@odinson.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Loki', 43, 'loki@odinson.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Hela', 27, 'hela@odinson.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Thanos', 27, 'thanos@thanos.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Groot', 33, 'groot@groot.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Gamora', 10, 'gamora@gamora.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Strange', 67, 'doctor@strange.com');
INSERT INTO STUDENT (Name, Age, Email) VALUES ('Wong', 99, 'wong@wong.com');


INSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)
VALUES ("BTEch", 90, 1);

INSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)
VALUES ("BBA", 120, 2);
INSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)
VALUES ("MBA", 50, 3);
INSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)
VALUES ("Phy. Hons.", 40, 4);
INSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)
VALUES ("Pol. Sci", 20, 5);
INSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)
VALUES ("History Hons.", 35, 6);
INSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)
VALUES ("MTech", 100, 7);
INSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)
VALUES ("BCom", 45, 8);
INSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)
VALUES ("BEd.", 50, 9);
INSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)
VALUES ("Hospitality", 60, 10);


SELECT * FROM STUDENT;

SELECT *
FROM STUDENT
WHERE AGE < 50;


-- Age is between 34 - 75 (both inclusive) and admn_id is not 10
SELECT *
FROM STUDENT
WHERE AGE >= 34 AND AGE <= 75;

SELECT *
FROM STUDENT
WHERE AGE BETWEEN 34 AND 75;


-- CRUD

-- UPDATE
-- SYNATX: UPDATE table_name SET col=val, col=val.... WHERE condition;

UPDATE STUDENT
SET Name='IronMan'
WHERE ADMN_ID=6;

UPDATE STUDENT
SET Name='Steve Rogers', Age=170
WHERE ADMN_ID=3;

USE University;

-- DELETE
-- SYNTAX: DELETE FROM table_name WHERE condition;

DELETE FROM University.STUDENT WHERE ADMN_ID=14;

-- Error Code: 1046. No database selected Select the default DB to be used by double-clicking its name in the SCHEMAS list in the sidebar.

-- DROP vs DELETE vs TRUNCATE

TRUNCATE TABLE STUDENT;


CREATE TABLE RANDOM(
Name varchar(200),
Age int
);

INSERT INTO RANDOM(NAME, AGE) VALUES ("Tony", 45);
INSERT INTO RANDOM(NAME, AGE) VALUES ("Steve", 56);
INSERT INTO RANDOM(NAME, AGE) VALUES ("Bruce", 67);


TRUNCATE TABLE RANDOM;



-- Aggregation Function - MAX, MIN, COUNT, SUM, AVG

SELECT * FROM STUDENT;

-- MAX()
SELECT MAX(AGE) FROM STUDENT;

-- SUBQUERY - A query inside a query

SELECT *
FROM STUDENT
WHERE AGE=(SELECT MAX(AGE) FROM STUDENT);


-- MIN()
SELECT MIN(AGE)
FROM STUDENT;


SELECT *
FROM STUDENT
WHERE AGE=(SELECT MIN(AGE) FROM STUDENT);


-- COUNT()

SELECT COUNT(NAME)
FROM STUDENT
WHERE AGE > 20;


-- AVG()

SELECT AVG(AGE)
FROM STUDENT;


-- AVG = SUM()/COUNT()


-- SUM()
SELECT SUM(AGE)
FROM STUDENT;



-- INNER JOIN
-- SYNTAX:
-- SELECT col_name
-- FROM table_1
-- INNER JOIN table_2
-- ON table_1.col_name = table_2.col_name;


SELECT STUDENT.ADMN_ID, NAME, COURSE_NAME
FROM STUDENT
INNER JOIN COURSE_INFO
ON STUDENT.ADMN_ID = COURSE_INFO.ADMN_ID;
"""

'\nCREATE DATABASE University;\n\nUSE University;\n\nCREATE TABLE STUDENT(\nADMN_ID int AUTO_INCREMENT,\nNAME char(100) NOT NULL,\nAGE int,\nEmail varchar(200) UNIQUE,\nPRIMARY KEY(ADMN_ID)\n);\n\n\nCREATE TABLE COURSE_INFO(\nCOURSE_ID int AUTO_INCREMENT,\nCOURSE_NAME char(100) NOT NULL,\nCOURSE_CREDITS int NOT NULL,\nADMN_ID int NOT NULL,\nPRIMARY KEY (COURSE_ID),\nFOREIGN KEY (ADMN_ID) REFERENCES STUDENT(ADMN_ID)\n);\n\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Steve\', 100, \'steve@rogers.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Clint\', 56, \'clint@barton.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Bruce\', 100, \'bruce@banner.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Tony\', 78, \'tony@stark.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Natasha\', 98, \'natasha@romaoff.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Peter\', 34, \'peter@parker.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Thor\', 15, \'thor@odinson.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Loki\', 43, \'loki@odinson.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Hela\', 27, \'hela@odinson.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Thanos\', 27, \'thanos@thanos.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Groot\', 33, \'groot@groot.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Gamora\', 10, \'gamora@gamora.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Strange\', 67, \'doctor@strange.com\');\nINSERT INTO STUDENT (Name, Age, Email) VALUES (\'Wong\', 99, \'wong@wong.com\');\n\n\nINSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)\nVALUES ("BTEch", 90, 1);\n\nINSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)\nVALUES ("BBA", 120, 2);\nINSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)\nVALUES ("MBA", 50, 3);\nINSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)\nVALUES ("Phy. Hons.", 40, 4);\nINSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)\nVALUES ("Pol. Sci", 20, 5);\nINSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)\nVALUES ("History Hons.", 35, 6);\nINSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)\nVALUES ("MTech", 100, 7);\nINSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)\nVALUES ("BCom", 45, 8);\nINSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)\nVALUES ("BEd.", 50, 9);\nINSERT INTO COURSE_INFO (COURSE_NAME, COURSE_CREDITS, ADMN_ID)\nVALUES ("Hospitality", 60, 10);\n\n\nSELECT * FROM STUDENT;\n\nSELECT *\nFROM STUDENT\nWHERE AGE < 50;\n\n\n-- Age is between 34 - 75 (both inclusive) and admn_id is not 10\nSELECT *\nFROM STUDENT\nWHERE AGE >= 34 AND AGE <= 75;\n\nSELECT *\nFROM STUDENT\nWHERE AGE BETWEEN 34 AND 75;\n\n\n-- CRUD\n\n-- UPDATE\n-- SYNATX: UPDATE table_name SET col=val, col=val.... WHERE condition;\n\nUPDATE STUDENT\nSET Name=\'IronMan\'\nWHERE ADMN_ID=6;\n\nUPDATE STUDENT\nSET Name=\'Steve Rogers\', Age=170\nWHERE ADMN_ID=3;\n\nUSE University;\n\n-- DELETE\n-- SYNTAX: DELETE FROM table_name WHERE condition;\n\nDELETE FROM University.STUDENT WHERE ADMN_ID=14;\n\n-- Error Code: 1046. No database selected Select the default DB to be used by double-clicking its name in the SCHEMAS list in the sidebar.\n\n-- DROP vs DELETE vs TRUNCATE\n\nTRUNCATE TABLE STUDENT;\n\n\nCREATE TABLE RANDOM(\nName varchar(200),\nAge int\n);\n\nINSERT INTO RANDOM(NAME, AGE) VALUES ("Tony", 45);\nINSERT INTO RANDOM(NAME, AGE) VALUES ("Steve", 56);\nINSERT INTO RANDOM(NAME, AGE) VALUES ("Bruce", 67);\n\n\nTRUNCATE TABLE RANDOM;\n\n\n\n-- Aggregation Function - MAX, MIN, COUNT, SUM, AVG\n\nSELECT * FROM STUDENT;\n\n-- MAX()\nSELECT MAX(AGE) FROM STUDENT;\n\n-- SUBQUERY - A query inside a query\n\nSELECT *\nFROM STUDENT\nWHERE AGE=(SELECT MAX(AGE) FROM STUDENT);\n\n\n-- MIN()\nSELECT MIN(AGE)\nFROM STUDENT;\n\n\nSELECT *\nFROM STUDENT\nWHERE AGE=(SELECT MIN(AGE) FROM STUDENT);\n\n\n-- COUNT()\n\nSELECT COUNT(NAME)\nFROM STUDENT\nWHERE AGE > 20;\n\n\n-- AVG()\n\nSELECT AVG(AGE)\nFROM STUDENT;\n\n\n-- AVG = SUM()/COUNT()\n\n\n-- SUM()\nSELECT SUM(AGE)\nFROM STUDENT;\n\n\n\n-- INNER JOIN\n-- SYNTAX: \n-- SELECT col_name\n-- FROM table_1\n-- INNER JOIN table_2\n-- ON table_1.col_name = table_2.col_name;\n\n\nSELECT STUDENT.ADMN_ID, NAME, COURSE_NAME\nFROM STUDENT\nINNER JOIN COURSE_INFO\nON STUDENT.ADMN_ID = COURSE_INFO.ADMN_ID;\n'

In [3]:
import sqlite3 as sq

In [4]:
database = sq.connect('test.db')
print("Database is created")

Database is created

In [5]:
cur = database.cursor()

In [6]:
cur.fetchall()

[]

In [7]:
database

In [8]:
database.execute('''CREATE TABLE STUDENT(Name char(200), Age int)''')
print('Table is created.')

Table is created.

In [9]:
database.execute('''INSERT INTO STUDENT VALUES ('Loki', 23)''')
database.execute('''INSERT INTO STUDENT VALUES ('Thor', 45)''')
database.commit()
print('Data(s) is/are inserted.')

Data(s) is/are inserted.

In [10]:
data = database.execute('''SELECT * FROM STUDENT''')

In [11]:
data

In [12]:
for i in data:
  print(i)

('Loki', 23)
('Thor', 45)